Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: It is probably not the same user you use for normal shell or FTP access.
es: Devuelve TRUE en caso de éxito y FALSE en otro caso.

source: See also chown() and chgrp().
es: Ver también chown() y chgrp().

source: This function is an alias of rtrim().
es: Devuelve la cadena argumento sin los espacios sobrantes, incluyendo los saltos de línea.

source: Attempts to change the owner of the file filename to user user (specified by name or number).
es: Sólo el superusuario puede cambiar el propietario de un fichero.

source: Only the superuser may change the owner of a file.
es: Devuelve TRUE en caso de éxito; en otro caso devuelve FALSE.

source: See also chmod().
es: Ver también chown() y chmod().

source: $str .= chr( 27); / * add an escape character at the end of $str * / / * Often this is more useful * / $str = sprintf("The string ends in escape: %c", 27);
es: Devuelve una cadena de un caracter que congiene el caracter especificado por ascii.

source: You can find an ASCII-table over here: http: / /www.asciitable.com.
es: Ejemplo de chr()

source: See also sprintf() with a format string of %c.
es: $cad .= chr (27); / * añade un caracter de escape al final de $cad * / / * A veces esto es más útil * / $cad = sprintf ("La cadena termina en escape: %c", 27);

source: Returns TRUE on success or FALSE on failure..
es: Devuelve TRUE si todo fue bien, FALSE en caso de fallo..

source: Can be used to split a string into smaller chunks which is useful for e.g. converting base64_encode output to match RFC 2045 semantics.
es: Se puede utilizar para trocear una cadena en pedazos más pequeños, lo que es útil, p.ej., para convertir la salida de la función base64_encode a la semántica del RFC 2045.

# It inserts end (defaults to " ") every chunklen characters (defaults to 76).
source: It inserts end (defaults to "\r\n") every chunklen characters (defaults to 76).
es: Inserta la cadena final cada tamatrozo (por defecto vale 76) caracteres.

source: It returns the new string leaving the original string untouched.
es: Devuelve la nueva cadena y deja intacta la original.

source: Example 1. chunk_split() example
es: Ejemplo de chunk_split()

source: # format $data using RFC 2045 semantics $new_string = chunk_split( base64_encode($data));
es: # formatear $datos usando la semántica del RFC 2045 $nueva_cad = chunk_split (base64_encode($datos));

source: See also explode(), split() wordwrap() and RFC 2045.
es: Esta función se añadió en la 3.0.6.

source: However, in certain cases, you may want to clear the cached information.
es: Por lo tanto, el resultado de la última llamada a cualquiera de las funciones de estado (listadas abajo) es guardado para usarlo en la próxima llamada de este tipo empleando el mismo nombre de fichero.

source: In these cases, you can use the clearstatcache() function to clear the information that PHP caches about a file.
es: Si deseas forzar un nuevo chequeo del estado del fichero, por ejemplo si el fichero está siendo chequeado muchas veces y puede cambiar o desaparecer, usa esta función para borrar los resultados almacenados en memoria de la última llamada.

source: This function caches information about specific filenames, so you only need to call clearstatcache() if you are performing multiple operations on the same filename and require the information about that particular file to not be cached.
es: Este valor sólo es cacheado durante el tiempo de vida de una petición simple.

source: Affected functions include stat(), lstat(), file_exists(), is_writable(), is_readable(), is_executable(), is_file(), is_dir(), is_link(), filectime(), fileatime(), filemtime(), fileinode(), filegroup(), fileowner(), filesize(), filetype(), and fileperms().
es: Entre las funciones afectadas se incluyen stat(), lstat(), file_exists(), is_writeable(), is_readable(), is_executable(), is_file(), is_dir(), is_link(), filectime(), fileatime(), filemtime(), fileinode(), filegroup(), fileowner(), filesize(), filetype(), y fileperms().

source: Closes the directory stream indicated by dir_handle.
es: Cierra la secuencia de directorio determinada por dir_handle.

source: The stream must have previously been opened by opendir().
es: La secuencia debe de haber sido abierta previamente con opendir().

source: The use of closelog() is optional.
es: closelog() cierra el descriptor que se está usando para escribir en el logger del sistema.

source: See also define_syslog_variables(), syslog() and openlog().
es: El uso de closelog() es opcional.

source: compact() takes a variable number of parameters.
es: compact() toma un número variable de parámetros.

source: Each parameter can be either a string containing the name of the variable, or an array of variable names.
es: Cada uno puede ser tanto una cadena que contiene el nombre de la variable, como una matriz de nombres de variable.

source: The array can contain other arrays of variable names inside it; compact() handles it recursively.
es: La matriz puede contener otras matrices de nombres de variable en su interior; compact() los procesa recursivamente.

source: For each of these, compact() For each of these, compact() looks for a variable with that name in the current symbol table and adds it to the output array such that the variable name becomes the key and the contents of the variable become the value for that key.
es: Para cada uno de estos, compact() busca una variable con dicho nombre en la tabla de símbolos y la añade a la matriz de salida de modo que el nombre de la variable es la clave y el contenido de ésta es el valor para dicha clave.

source: In short, it does the opposite of extract().
es: Para resumir, hace lo contrario de extract().

source: It returns the output array with all the variables added to it.
es: Devuelve la matriz de salida con las variables añadidas a la misma.

source: Any strings that are not set will simply be skipped.
es: Ejemplo de compact()

source: Example 1. compact() example
es: Tras esto, $resultado valdrá array ("evento "= "SIGGRAPH", "ciudad" = "San Francisco", "estado "= "CA").

source: After this, $result will be:
es: Vea también: extract().

source: See also extract().
es: Esta función fue añadida en el PHP 4.0.

source: This function is an alias for com_set().
es: Esta función es un alias para com_propput().

source: Returns the newly set value if succeeded, FALSE on error.
es: Esta función es un alias para com_set().

source: Returns TRUE if client disconnected.
es: Devuelve TRUE si el cliente está desconectado.

source: See the Connection Handling description in the Features chapter for a complete explanation.
es: Vea la descripción de la Gestión de la Conexión en el capítulo Características para una explicación completa.

source: Miscellaneous functions
es: Miscelánea de funciones

source: Returns the connection status bitfield.
es: Devuelve el estado de la conexión en un campo de bits.

source: Deprecated
es: Devuelve TRUE si el script ha alcanzado su time out.

source: Example 1. constant() example
es: Ejemplo 1. constant() example

source: This function returns the given string converted from one Cyrillic character set to another.
es: Esta función convierte la cadena dada de un juego de caracteres Cirílico a otro.

source: The from and to arguments are single characters that represent the source and target Cyrillic character sets.
es: Los argumentos desde y hasta son caracteres sencillos que representan los juegos de caracteres Cirílicos fuente y destino.

source: The supported types are:
es: Los tipos soportados son:

source: Example 1. copy() example
es: Hace una copia de un fichero.

source: As of PHP 4.3.0, both source and dest may be URLs if the "fopen wrappers" have been enabled.
es: Ejemplo 1.

source: See fopen() for more details.
es: Ejemplo de copy()

source: See also move_uploaded_file(), rename(), and the section of the manual about handling file uploads.
es: Ver también: rename().

source: The arg parameter is in radians.
es: Devuelve el coseno de arg en radianes.

source: See also acos(), sin() tan() and deg2rad().
es: Vea también sin() y tan().

source: Counts the number of occurrences of every byte-value (0..255) in string and returns it in various ways.
es: Cuenta el número de apariciones de cada valor de byte (0..255) en cadena y lo devuelve de varias maneras.

source: The optional parameter Mode default to 0.
es: El parámetro opcional modo vale por defecto 0.

source: Depending on mode count_chars() returns one of the following:
es: Dependiendo de modo, count_chars() puede devolver:

source: 0 - an array with the byte-value as key and the frequency of every byte as value.
es: 0 - una matriz con el valor del byte como clave y la frecuencia de cada uno como valor.

source: 1 - same as 0 but only byte-values with a frequency greater than zero are listed.
es: 1 - como el 0, pero listando únicamente los valores de byte con frecuencia superior a cero.

source: 2 - same as 0 but only byte-values with a frequency equal to zero are listed.
es: 2 - como el 0, pero listando únicamente los valores de byte con frecuencia igual a 0.

source: 3 - a string containing all used byte-values is returned.
es: 3 - se devuelve una cadena que contiene todos los valores de byte utilizados.

source: 4 - a string containing all not used byte-values is returned.
es: 4 - se devuelve una cadena que contiene todos los valores de byte no utilizados.

source: See also strpos() and substr_count().
es: Esta función se añadió en el PHP 4.0.

source: If var is not an array, 1 will be returned (exception: count (NULL) equals 0).
es: Devuelve el número de elementos en var, que típicamente es una matriz (porque cualquier otra cosa tendría sólo un elemento).

source: count() may return 0 for a variable that isn't set, but it may also return 0 for a variable that has been initialized with an empty array.
es: Devuelve 0 si la variable no tiene valor.

source: Use isset() to test if a variable is set.
es: Aviso

source: Example 1. count() example
es: count() puede devolver 0 para una variable sin valor, pero también puede devolver 0 para una variable ya inicializada pero con una matriz vacía.

source: See also is_array(), isset(), and strlen().
es: Vea también: sizeof(), isset(), y is_array().

source: The cpdf_add_annotation() adds a note with the lower left corner at (llx, lly) and the upper right corner at (urx, ury).
es: La función cpdf_add_annotation() añade una nota con la esquina inferior izquierda en (llx, lly) y la esquina superior derecha en (urx, ury).

source: The optional parameter mode determines the unit length.
es: El últomo parámetro opcional determina el tamaño de la unidad.

source: If it 's 0 or omitted the default unit as specified for the page is used.
es: Si es 0 o se omite, se usa la unidad por defecto especificada para la página.

source: Otherwise the coordinates are measured in postscript points disregarding the current unit.
es: De otro modo las coordenadas se miden en puntos postscript, despreciando la unidad actual.

source: The cpdf_add_outline() function adds a bookmark with text text that points to the current page.
es: La función cpdf_add_outline() añade una marca con el texto text que apunta a la página actual.

source: Adding a page outline
es: Añadiendo un contorno de página

source: ?php $cpdf = cpdf_open( 0); cpdf_page_init($cpdf, 1, 0, 595, 842); cpdf_add_outline($cpdf, 0, 0, 0, 1, "Page 1"); / /... / / some drawing / /... cpdf_finalize($cpdf); Header("Content-type: application / pdf"); cpdf_output_buffer($cpdf); cpdf_close($cpdf);?
es: ?php $cpdf = cpdf_open( 0); cpdf_page_init($cpdf, 1, 0, 595, 842); cpdf_add_outline($cpdf, 0, 0, 0, 1, "Página 1"); / /... / / Algún dibujo / /... cpdf_finalize($cpdf); Header("Content-type: application / pdf"); cpdf_output_buffer($cpdf); cpdf_close($cpdf);?

source: The cpdf_arc() function draws an arc with center at point (x-coor, y-coor) and radius radius, starting at angle start and ending at angle end.
es: La función cpdf_arc() dibuja un arco con el centro rn el punto (x-koor, y-koor) y radio radius, empezando en el ángulo start y terminando en el ángulo end.

source: See also cpdf_circle().
es: Vea también cpdf_circle().

source: The cpdf_begin_text() function starts a text section.
es: La función cpdf_begin_text() La función cpdf_begin_text() comienza una sección de texto.

source: It must be ended with cpdf_end_text().
es: Debe ser terminada con cpdf_end_text().

source: Text output
es: Salida de texto

source: ?php cpdf_begin_text( $pdf); cpdf_set_font($pdf, 16, "Helvetica", "WinAnsiEncoding"); cpdf_text($pdf, 100, 100, "Some text"); cpdf_end_text($pdf)?
es: ?php cpdf_begin_text( $pdf); cpdf_set_font($pdf, 16, "Helvetica", "WinAnsiEncoding"); cpdf_text($pdf, 100, 100, "Algún texto"); cpdf_end_text($pdf)?

source: See also cpdf_end_text().
es: Vea también cpdf_end_text().

source: The cpdf_circle() function draws a circle with center at point (x-coor, y-coor) and radius radius.
es: La función cpdf_circle() dibuja un círculo con centro en el punto (x-koor, y-koor) y radio radius.

source: See also cpdf_arc().
es: Vea también cpdf_arc().

source: The cpdf_clip() function clips all drawing to the current path.
es: La función cpdf_clip() ajusta todos los dibujos al camino actual.

source: The cpdf_close() function closes the pdf document.
es: La función cpdf_close() cierra un documento PDF.

source: This should be the last function even after cpdf_finalize(), cpdf_output_buffer() and cpdf_save_to_file().
es: Esta debería ser la última operación incluso después de cpdf_finalize(), cpdf_output_buffer() y cpdf_save_to_file().

source: See also cpdf_open().
es: Vea también cpdf_open().

source: The cpdf_closepath_fill_stroke() function closes, fills the interior of the current path with the current fill color and draws current path.
es: La función cpdf_closepath_fill_stroke() cierra, llena el interior del caminoa catual con el color actual de relleno y dibuja el camino actual.

source: See also cpdf_closepath(), cpdf_stroke(), cpdf_fill(), cpdf_setgray_fill(), cpdf_setgray(), cpdf_setrgbcolor_fill(), cpdf_setrgbcolor().
es: Vea también cpdf_closepath(), cpdf_stroke(), cpdf_fill(), cpdf_setgray_fill(), cpdf_setgray(), cpdf_setrgbcolor_fill(), cpdf_setrgbcolor().

source: The cpdf_closepath() function closes the current path.
es: La función cpdf_closepath() cierra el camino actual.

source: The cpdf_closepath_stroke() function is a combination of cpdf_closepath() and cpdf_stroke().
es: La función cpdf_closepath_stroke() es una combinación de cpdf_closepath() y cpdf_stroke().

source: Then clears the path.
es: Después limpia el camino.

source: See also cpdf_closepath(), cpdf_stroke().
es: Vea también cpdf_closepath(), cpdf_stroke().

source: The cpdf_continue_text() function outputs the string in text in the next line.
es: La función cpdf_continue_text() pone la cadena text en la línea siguiente.

source: See also cpdf_show_xy(), cpdf_text(), cpdf_set_leading(), cpdf_set_text_pos().
es: Vea también cpdf_show_xy(), cpdf_text(), cpdf_set_leading(), cpdf_set_text_pos().

source: The cpdf_curveto() function draws a Bezier curve from the current point to the point (x3, y3) using (x1, y1) and (x2, y2) as control points.
es: La función cpdf_curveto() dibuja una curva Bezier desde el punto actual al punto (x3, y3) usando (x1, y1) y (x2, y2) como puntos de control.

source: See also cpdf_moveto(), cpdf_rmoveto(), cpdf_rlineto(), cpdf_lineto().
es: Vea también cpdf_moveto(), cpdf_rmoveto(), cpdf_rlineto(), cpdf_lineto().

source: The cpdf_end_text() function ends a text section which was started with cpdf_begin_text().
es: La función cpdf_end_text() finaliza unasección de texto que fue inicializada con cpdf_begin_text().

source: See also cpdf_begin_text().
es: Vea también cpdf_begin_text().

source: The cpdf_fill() function fills the interior of the current path with the current fill color.
es: La función cpdf_fill() llena el interior del camino actual con el color alctual de relleno.

source: See also cpdf_closepath(), cpdf_stroke(), cpdf_setgray_fill(), cpdf_setgray(), cpdf_setrgbcolor_fill(), cpdf_setrgbcolor().
es: Vea también cpdf_closepath(), cpdf_stroke(), cpdf_setgray_fill(), cpdf_setgray(), cpdf_setrgbcolor_fill(), cpdf_setrgbcolor().

source: The cpdf_fill_stroke() function fills the interior of the current path with the current fill color and draws current path.
es: La función cpdf_fill_stroke() llena el interior del camino actual con el color de relleno actual y dibuja el camino actual.

source: The cpdf_finalize() function ends the document.
es: La función cpdf_finalize() La función cpdf_finalize() finaliza un documento.

source: You still have to call cpdf_close()
es: Aún se tiene que llamar a cpdf_close().

source: See also cpdf_close().
es: Vea también cpdf_close().

source: The cpdf_finalize_page() function ends the page with page number page number.
es: La función cpdf_finalize_page() finaliza una página con número de página page number.

source: This function is only for saving memory.
es: Esta función es sólo para ahorrar memoria.

source: A finalized page takes less memory but cannot be modified anymore.
es: Una página terminada ocupa menos memoria pero no puede volver a ser modificada.

source: See also cpdf_page_init().
es: Vea también cpdf_page_init().

source: The cpdf_global_set_document_limits() function sets several document limits.
es: La función cpdf_global_set_document_limits() define varios límites del documento.

source: This function has to be called before cpdf_open() to take effect.
es: Esta función debe ser llamada antes de cpdf_open() para que haga efecto.

source: It sets the limits for any document open afterwards.
es: Ello define los límites de cualquier documento abierto con anterioridad.

source: The cpdf_import_jpeg() function opens an image stored in the file with the name file name.
es: La función cpdf_import_jpeg() abre una imagen almacenada en el fichero de nombre file name.

source: The format of the image has to be jpeg.
es: El formato de la imagen debe ser JPEG.

source: The image is placed on the current page at position (x-coor, y-coor).
es: La imagen es situada en la página actual en la posición (x-koor, y-koor).

source: The image is rotated by angle degrees.
es: La imagen es rotada angle grados.

source: See also cpdf_place_inline_image().
es: Vea también cpdf_place_inline_image(),

source: The cpdf_lineto() function draws a line from the current point to the point with coordinates (x-coor, y-coor).
es: La función cpdf_lineto() dibuja una línea desde el punto actual al punto con coordenadas (x-koor, y-koor).

source: See also cpdf_moveto(), cpdf_rmoveto(), cpdf_curveto().
es: Vea también cpdf_moveto(), cpdf_rmoveto(), cpdf_curveto().

source: The cpdf_moveto() function set the current point to the coordinates x-coor and y-coor.
es: La función cpdf_moveto() pone el punto actual en las coordenadas x-koor y y-koor.

source: The cpdf_open() function opens a new pdf document.
es: LA función cpdf_open() abre un documento PDF nuevo.

source: The first parameter turns document compression on if it is unequal to 0.
es: El primer parámetro activa la compresión del documento si no es igual a 0.

source: The second optional parameter sets the file in which the document is written.
es: El segundo parámetro, opcional, es el fichero en el que el documento es escrito.

source: If it is omitted the document is created in memory and can either be written into a file with the cpdf_save_to_file() or written to standard output with cpdf_output_buffer().
es: Si es omitido, el documento es creado en memoria y puede ser escrito en un fichero mediante la función cpdf_save_to_file() o escrito por la salida estándar con cpdf_output_buffer().

source: The return value will be needed in further versions of ClibPDF as the first parameter in all other functions which are writing to the pdf document.
es: El valor de retorno será necesario en nuevas versiones de ClibPDF como el primer parámetro en todas las demás funciones que escriben en el documento PDF.

source: The ClibPDF library takes the filename "-" as a synonym for stdout.
es: La librería ClibPDF toma el nombre de fichero "-" como sinónimo de stdout (salida estándar).

source: If PHP is compiled as an apache module this will not work because the way ClibPDF outputs to stdout does not work with apache.
es: Si se compila PHP como módulo de apache esto no funcionará porque la manera en que ClibPDF direcciona a la salida estándar no funciona con apache.

source: You can solve this problem by skipping the filename and using cpdf_output_buffer() to output the pdf document.
es: Usted puede solucionar este problema evitando el enobre de fichero y usando cpdf_output_buffer() para la salida de documentos PDF.

source: See also cpdf_close(), cpdf_output_buffer().
es: Vea también cpdf_close(), cpdf_output_buffer().

source: The cpdf_output_buffer() The cpdf_output_buffer() function outputs the pdf document to stdout.
es: La función cpdf_output_buffer() La función cpdf_output_buffer() muestra el documento PDF por la salida estándar.

source: The document has to be created in memory which is the case if cpdf_open() has been called with no filename parameter.
es: El documento debe ser creado en memoria, que es el caso de la función cpdf_open() cuando ha sido llamada sin parámetros.

source: The cpdf_page_init() function starts a new page with height height and width width.
es: La función cpdf_page_init() crea una nueva página de altura height y profundidad width.

source: The page has number page number and orientation orientation. orientation can be 0 for portrait and 1 for landscape.
es: La página tiene el número page number y orientación orientation. orientation puede ser 0 para retrato y 1 para paisaje.

source: The last optional parameter unit sets the unit for the coordinate system.
es: El último parámetro opcional unit define la unidad del sistema de coordenadas.

source: The value should be the number of postscript points per unit.
es: El valor debería ser el número de puntos postscript por unidad.

source: Since one inch is equal to 72 points, a value of 72 would set the unit to one inch.
es: Como el valor de una pulgada el igual a 72 puntos, un valor de 72 sería la unidad para una pulgada.

source: The default is also 72.
es: Por defecto es 72.

source: See also cpdf_set_current_page().
es: Vea también cpdf_set_current_page().

source: The cpdf_place_inline_image() function places an image created with the php image functions on the page at position (x-coor, y-coor).
es: La función cpdf_place_inline_image() situa una imagen creada con las funciones de imagenes de PHP en la posición de la página (x-koor, y-koor).

source: The image can be scaled at the same time.
es: La imagen puede ser escalada al mismo tiempo.

source: See also cpdf_import_jpeg().
es: Vea también cpdf_import_jpeg(),

source: The cpdf_rect() function draws a rectangle with its lower left corner at point (x-coor, y-coor).
es: La función cpdf_rect() dibuja un rectángulo con su esquina inferior izquierda en el punto (x-koor, y-koor).

source: This width is set to width.
es: La anchura es widgth.

source: This height is set to height.
es: La altura es height.

source: The cpdf_restore() function restores the environment saved with cpdf_save().
es: La función cpdf_restore() restaura el entorno salvado con cpdf_save().

source: It works like the postscript command grestore.
es: Funciona como el comando grestore de postscript.

source: Very useful if you want to translate or rotate an object without effecting other objects.
es: Muy útil si se quiere trasladar o rotar un objeto sin afectar ortros objetos.

source: Save / Restore
es: Salvar / Restaurar
